#language:ru
@lanit
Функционал: Сохранение поискового запроса Helpdesk

  Сценарий: Создание нового тикета, его поиск и сохранение поискового запроса

    # Открывает Страницу Helpdesk
    * открыть url "https://at-sandbox.workbench.lanit.ru/"
    * инициализация страницы "Lanit"
    * на странице имеется элемент "New Ticket"
    * кликнуть на элемент "New Ticket"

    # Заполяет форму тикета и жмет на кнопку Submit Ticket
    * на странице имеется элемент "Queue"
    * кликнуть на элемент "Queue"
    * кликнуть на элемент по тексту "Some Product"
    #--
    * на странице имеется элемент "Summary of the problem"
    * ввести в поле "Summary of the problem" значение "akunamatata1"
    #--
    * на странице имеется элемент "Priority"
    * кликнуть на элемент "Priority"
    * кликнуть на элемент по тексту "2. High"
    #--
    * на странице имеется элемент "Your E-Mail Address"
    * ввести в поле "Your E-Mail Address" значение "example@email.ru"
    #--
    * на странице имеется элемент "Submit Ticket"
    * кликнуть на элемент "Submit Ticket"

    # Жмет на кнопку Login, заполняет форму и авторизуется
    * на странице имеется элемент "Log in"
    * кликнуть на элемент "Log in"
    #--
    * на странице имеется элемент "Username"
    * ввести в поле "Username" значение "admin"
    #--
    * на странице имеется элемент "Password"
    * ввести в поле "Password" значение "adminat"
    #--
    * на странице имеется элемент "checkbox1"
    * кликнуть на элемент "checkbox1"
    #--
    * на странице имеется элемент "Login"
    * кликнуть на элемент "Login"

    # Заполняет форму Search... и жмет на кнопку поиска
    * на странице имеется элемент "Search..."
    * ввести в поле "Search..." значение "akunamatata1"
    #--
    * на странице имеется элемент "Go"
    * кликнуть на элемент "Go"

    # Задает параметры поискового запроса и сохраняет
    * на странице имеется элемент "Save Query"
    * кликнуть на элемент "Save Query"
    #--
    * на странице имеется элемент "Query Name"
    * ввести в поле "Query Name" значение "name123"
    #--
    * на странице имеется элемент "checkbox2"
    * кликнуть на элемент "checkbox2"
    #--
    * на странице имеется элемент "Save Query Btn"
    * кликнуть на элемент "Save Query Btn"
